cmsis-svd/cmsis-svd/data/Spansion/MB9AFA3xL_svd.xml
        <!-- REGISTER "IRQ28MON" -->
        <register>
          <name>IRQ28MON</name>
          <description>IRQ28 Batch Read Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description>IRQ1 interrupt request on the base timer ch.7</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description>IRQ0 interrupt request on the base timer ch.7</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description>IRQ1 interrupt request on the base timer ch.6</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description>IRQ0 interrupt request on the base timer ch.6</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description>IRQ1 interrupt request on the base timer ch.5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description>IRQ0 interrupt request on the base timer ch.5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description>IRQ1 interrupt request on the base timer ch.4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description>IRQ0 interrupt request on the base timer ch.4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description>IRQ1 interrupt request on the base timer ch.3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description>IRQ0 interrupt request on the base timer ch.3</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description>IRQ1 interrupt request on the base timer ch.2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description>IRQ0 interrupt request on the base timer ch.2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description>IRQ1 interrupt request on the base timer ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description>IRQ0 interrupt request on the base timer ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>IRQ1 interrupt request on the base timer ch.0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>IRQ0 interrupt request on the base timer ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ29MON" -->
        <register>
          <name>IRQ29MON</name>
          <description>IRQ29 Batch Read Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x10</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDCINT" -->
            <field>
              <name>LCDCINT</name>
              <description>LCDC interrupt request for LCD controller </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ30MON" -->
        <register>
          <name>IRQ30MON</name>
          <description>IRQ30 Batch Read Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC0INT" -->
            <field>
              <name>RCEC0INT</name>
              <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ31MON" -->
        <register>
          <name>IRQ31MON</name>
          <description>IRQ31 Batch Read Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x40</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC1INT" -->
            <field>
              <name>RCEC1INT</name>
              <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
